21Day/src/Reports/ОтчетПоИзменениямЦен/ОтчетПоИзменениямЦен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ОтчетПоИзменениямЦен</name>
</mdclass:Report>

21Day/src/Catalogs/ИзменениеЦен/ИзменениеЦен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИзменениеЦен</name>
  <attributes>
    <name>Документ</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Изменения</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СтараяЦена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НоваяЦена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

21Day/src/Reports/ОтчетПоИзменениямЦен/Forms/ФормаОтчета/Module.bsl
&НаКлиенте
Процедура Сформировать(Команда)
	
	ТабДок = Новый ТабличныйДокумент;
	
	СформироватьНаСервере(Период.ДатаНачала, Период.ДатаОкончания, ТабДок);
	ТабДок.Показать();
	
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СформироватьНаСервере( ДатаНачала, ДатаОкончания, ТабДок)

  ТаблицаЖР = Новый ТаблицаЗначений;	
  //Фильтр = Новый Структура;
  //Фильтр.Вставить("ДатаНачала, ДатаОкончания", ДатаНачала, ДатаОкончания );
  Фильтр =  Новый Структура("ДатаНачала, ДатаОкончания", ДатаНачала, ДатаОкончания );
  Фильтр.Вставить("Событие", "Махинации" );
  ВыгрузитьЖурналРегистрации(ТаблицаЖР,Фильтр);
  
   
         	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Макет = Отчеты.ОтчетПоИзменениямЦен.ПолучитьМакет("Макет");
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЖР.ИмяПользователяЖР КАК ИмяПользователя,
		|	ЖР.ДанныеЖР КАК Данные,
		|	ЖР.ДатаЖР КАК Дата
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	&ТаблицаЖР КАК ЖР
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ВТ.ИмяПользователя КАК СТРОКА(100)) КАК ИмяПользователя,
		|	ВТ.Дата КАК Дата,
		|	ИзменениеЦенИзменения.Номенклатура КАК Номенклатура,
		|	ИзменениеЦенИзменения.СтараяЦена КАК СтараяЦена,
		|	ИзменениеЦенИзменения.НоваяЦена КАК НоваяЦена,
		|	ИзменениеЦенИзменения.Ссылка.Документ КАК Документ
		|ИЗ
		|	ВТ КАК ВТ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИзменениеЦен.Изменения КАК ИзменениеЦенИзменения
		|		ПО ВТ.Данные = ИзменениеЦенИзменения.Ссылка
		|ИТОГИ ПО
		|	ИмяПользователя";
	
	//Таблица = Новый ТаблицаЗначений;
	ТаблицаЖР.Колонки.Добавить("ИмяПользователяЖР", Новый ОписаниеТипов("Строка"));
	ТаблицаЖР.Колонки.Добавить("ДатаЖР", Новый ОписаниеТипов("Дата"));
	ТаблицаЖР.Колонки.Добавить("ДанныеЖР", Новый ОписаниеТипов("Справочникссылка.ИзменениеЦен"));

    ТаблицаЖР.ЗагрузитьКолонку( ТаблицаЖР.ВыгрузитьКолонку("ИмяПользователя"), "ИмяПользователяЖР");
	ТаблицаЖР.ЗагрузитьКолонку( ТаблицаЖР.ВыгрузитьКолонку("Дата"), "ДатаЖР");
    ТаблицаЖР.ЗагрузитьКолонку( ТаблицаЖР.ВыгрузитьКолонку("Данные"), "ДанныеЖР");

	
	
	
	Запрос.УстановитьПараметр("ТаблицаЖР", ТаблицаЖР);
	РезультатЗапроса = Запрос.Выполнить();
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицы");
	ОбластьИмяПользователя = Макет.ПолучитьОбласть("ИмяПользователя");
	ОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("Детали");
	
	ТабДок.Очистить();
	ТабДок.Вывести(ОбластьЗаголовок);
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	ТабДок.НачатьАвтогруппировкуСтрок();
	
	ВыборкаИмяПользователя = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаИмяПользователя.Следующий() Цикл
		ОбластьИмяПользователя.Параметры.Заполнить(ВыборкаИмяПользователя);
		ТабДок.Вывести(ОбластьИмяПользователя, ВыборкаИмяПользователя.Уровень());
	
		ВыборкаДетальныеЗаписи = ВыборкаИмяПользователя.Выбрать();
	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ОбластьДетальныхЗаписей.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
			ТабДок.Вывести(ОбластьДетальныхЗаписей, ВыборкаДетальныеЗаписи.Уровень());
		КонецЦикла;
	КонецЦикла;
	
	ТабДок.ЗакончитьАвтогруппировкуСтрок();
	ТабДок.Вывести(ОбластьПодвалТаблицы);
	ТабДок.Вывести(ОбластьПодвал);
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

     
  
  
  
  
КонецПроцедуры
